In [1]:
import pandas as pd

## Loading Data into Pandas

In [2]:
#Import from CSV
df = pd.read_csv("teacher_by_status_and_county_for_secondary.csv")
df

,COUNTY,School Type,Employment Body,No. of Teachers,County (centroid),Year
0,Baringo,Public,TSC,1172,"(0.669252, 35.946465)",12/31/2014 12:00:00 AM
1,Bomet,Public,TSC,1379,"(-0.726295, 35.298598)",12/31/2014 12:00:00 AM
2,Bungoma,Public,TSC,2946,"(0.749285, 34.640461)",12/31/2014 12:00:00 AM
3,Busia,Public,TSC,1182,"(0.387444, 34.193631)",12/31/2014 12:00:00 AM
4,Elgeyo Marakwet,Public,TSC,1087,"(0.802219, 35.536563)",12/31/2014 12:00:00 AM
...,...,...,...,...,...,...
187,Uasin Gishu,Private,TSC,0,"(0.526086, 35.322012)",12/31/2014 12:00:00 AM
188,Vihiga,Private,TSC,0,"(0.076266, 34.722323)",12/31/2014 12:00:00 AM
189,Wajir,Private,TSC,0,"(1.808138, 40.034986)",12/31/2014 12:00:00 AM
190,West Pokot,Private,TSC,0,"(1.740106, 35.243847)",12/31/2014 12:00:00 AM
191,Kenya,Private,TSC,0,NaN,12/31/2014 12:00:00 AM

In [3]:
#show columns
df.columns

Index(['COUNTY', 'School Type', 'Employment Body', 'No. of Teachers',
       'County (centroid)', 'Year'],
      dtype='object')

In [4]:
#remove column
df.drop( 'County (centroid)', inplace=True, axis=1)
df

,COUNTY,School Type,Employment Body,No. of Teachers,Year
0,Baringo,Public,TSC,1172,12/31/2014 12:00:00 AM
1,Bomet,Public,TSC,1379,12/31/2014 12:00:00 AM
2,Bungoma,Public,TSC,2946,12/31/2014 12:00:00 AM
3,Busia,Public,TSC,1182,12/31/2014 12:00:00 AM
4,Elgeyo Marakwet,Public,TSC,1087,12/31/2014 12:00:00 AM
...,...,...,...,...,...
187,Uasin Gishu,Private,TSC,0,12/31/2014 12:00:00 AM
188,Vihiga,Private,TSC,0,12/31/2014 12:00:00 AM
189,Wajir,Private,TSC,0,12/31/2014 12:00:00 AM
190,West Pokot,Private,TSC,0,12/31/2014 12:00:00 AM
191,Kenya,Private,TSC,0,12/31/2014 12:00:00 AM

In [5]:
df.columns

Index(['COUNTY', 'School Type', 'Employment Body', 'No. of Teachers', 'Year'], dtype='object')

## Create Sqlite Database

In [6]:
import sqlite3
#connect to sqlite3 and create database
conn = sqlite3.connect('Education.db')
#create cursor object
mycursor = conn.cursor()
#Create table
# Create teacher table
mycursor.execute(''' CREATE TABLE IF NOT EXISTS Teacher 
            (COUNTY TEXT NOT NULL,
             School_Type TEXT NOT NULL,
             Employment_Body TEXT NOT NULL,
             No_of_Teachers INT NOT NULL,
             Year DATETIME NOT NULL);''')
conn.commit()


print("Database created successfully!")

Database created successfully!

## Convert Dataframe to SQL

In [7]:
df.to_sql('Teacher', conn, if_exists='replace', index=False)

teach = []
tbl="<tr><td>County</td><td>School Type</td><td>Employment Body</td><td>No. of Teachers</td><td>Year</td></tr>"
teach.append(tbl)

# Query to show sqlite table
mycursor.execute("SELECT * FROM Teacher")
#Insert tuple items to html
for y in mycursor.fetchall():
        a = "<tr><td>%s</td>"%y[0]
        teach.append(a)
        b = "<td>%s</td>"%y[1]
        teach.append(b)
        c = "<td>%s</td>"%y[2]
        teach.append(c)
        d = "<td>%s</td>"%y[3]
        teach.append(d)
        e = "<td>%s</td></tr>"%y[4]
        teach.append(e)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\generic.py:2605: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  sql.to_sql(

## Display Database on Web Browser

In [9]:
import webbrowser

 # Create html file
f = open('hrec.html', 'w')

# html docstring
the_html = '''<!DOCTYPE html>
    <html lang="en">
    <head>
        <meta cSharset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge">
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
        <title>Ministry of Education</title>
    </head>
    <body>
        <h1>Teacher Records</h1>
        <table style="border: solid; border-spacing: 25px, border-collapse: collapse;">
        <thead><caption><h2> TEACHERS </h2></caption></thead>
        %s
        </table>
        
    </body>
    </html>''' % (teach)  # from list

# write to html file
f.write(the_html)
    # close file
f.close()

    # Open file in browser
webbrowser.open_new_tab('hrec.html')

True

## Display Dataframe on Web Browser

In [36]:
html = r'<link rel ="stylesheet" type="text/css" media="screen"
html = df.to_html("index.html") 
# Create index.html to write html on it
fa = open("index.html","r+")
fa.close()

    # Open file in browser
webbrowser.open_new_tab('index.html')

True